import schools

questions = [
   {
        "question": "באיזו כיתה אתם?",
        "type": "closed_grade",  # שאלה סגורה
        "options": [ "כיתה י", "כיתה ח"],
        "session_state_answer":["SCHOOL_10","SCHOOL_8"],
        "feedbacks": ["תודה רבה",
                      "תודה רבה",
                      "תודה רבה",
                      "תודה רבה"],
        "time_count":"no"
    },
    {
        "question": "בחר את שם בית הספר שלך:",
        "type": "selectbox_schools",  # שאלה מסוג Selectbox
        "options": "null" ,#["אפק", "גוונים", "בגין"],  # שמות בתי הספר
        "feedbacks": "תודה",
        "time_count":"no"
    },
    {
        "question": "בנקודת זמן זאת, לפני תחילת התוכנית, אשמח לדעת מה אתם חושבים שהסיכוי שלכם להשתלב בעתיד בתחום ההייטק:",
        "type": "closed",  # שאלה סגורה
        "options": ["אין סיכוי בעולם", "סיכוי נמוך", "יש מצב טוב", "ברור שכן!"],
        "feedbacks": ["הבנתי. תודה על התשובה. אשמח שתספרו לי על זה עוד קצת.",
                      "הבנתי. תודה על התשובה. אשמח שתספרו לי על זה עוד קצת.",
                      "הבנתי. תודה על התשובה. אשמח שתספרו לי על זה עוד קצת.",
                      "הבנתי. תודה על התשובה. אשמח שתספרו לי על זה עוד קצת."],
        "time_count":"no"
    },
    {
        "question": "למה זה המצב לדעתכם?",
        "type": "open",  # שאלה פתוחה
        "feedback": "תודה, אני חושב שזה יהיה רעיון טוב לדבר על זה עם המורה שלך או מישהו מבוגר בחיים שלכם שאתם סומכים עליו, ותשתפו אותו במחשבות האלה.",
        "time_count":"no"
    },
    {
        "question": "אשמח אם תדרגו את השיחה:",
        "type": "closed",  # שאלה סגורה
        "options": ["1", "2", "3", "4", "5"],
        "feedbacks": ["תודה על הדירוג!", "תודה על הדירוג!", "תודה על הדירוג!", "תודה על הדירוג!", "תודה על הדירוג!"],
        "time_count":"yes"
    },
    {
        "question": "צפה בתמונה הבאה",
        "type": "image",  # שאלה סגורה
        "url":"almond.jpg",
        "time_count":"no"
    },
     {
        "question": "צפה בוידאו הבא",
        "type": "video",  # שאלה סגורה
        "url":"bird.mp4",
        "time_count":"no"
    },
     {
        "question": "אשמח אם תדרגו את השיחה:",
        "type": "closed",  # שאלה סגורה
        "options": ["1", "2", "3", "4", "5"],
        "feedbacks": ["תודה על הדירוג!", "תודה על הדירוג!", "תודה על הדירוג!", "תודה על הדירוג!", "תודה על הדירוג!"],
        "time_count":"yes"
    }
   
]